In [1]:
import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1.0], 
                 index = ['a','b','c','d'])

In [2]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [6]:
print(data[0:2])
print(data[['a','b','c']])

a    0.25
b    0.50
dtype: float64
a    0.25
b    0.50
c    0.75
dtype: float64

In [8]:
area = pd.Series({'california': 423967, 'texas':695662, 'new york': 141297, 'Florida':170312,
                  'Illinois': 149995})
pop = pd.Series({'california': 38332521, 'texas':26448193, 'new york': 19651127, 'Florida':19552860,
                  'Illinois': 12882135})
data= pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
california  423967  38332521
texas       695662  26448193
new york    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [11]:
data['area'] # = data.area 해도 됨

california    423967
texas         695662
new york      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [13]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
california  423967  38332521   90.413926
texas       695662  26448193   38.018740
new york    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [15]:
data.values
data.T # trasnpose matrix

           california         texas      new york       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [20]:
data.iloc[:3,:2]

              area       pop
california  423967  38332521
texas       695662  26448193
new york    141297  19651127

In [21]:
data.loc[data.density > 100, ['pop','area']]

               pop    area
new york  19651127  141297
Florida   19552860  170312

In [24]:
import pandas as pd
import numpy as np

rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [26]:
df = pd.DataFrame(rng.randint(0, 10, (3,4)), columns=['A','B','C','D'])
df

   A  B  C  D
0  1  7  5  1
1  4  0  9  5
2  8  0  9  2

In [28]:
np.exp(ser)
np.sin(df*np.pi/4)

              A         B         C         D
0  7.071068e-01 -0.707107 -0.707107  0.707107
1  1.224647e-16  0.000000  0.707107 -0.707107
2 -2.449294e-16  0.000000  0.707107  1.000000

In [33]:
area = pd.Series({'Alaska': 172337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                  'New York': 19651127}, name='population')

population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [34]:
area.index | population.index

/var/folders/4f/jnlgcb9n6pg311w43wdsllwc0000gn/T/ipykernel_10584/3572280633.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [37]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [38]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [39]:
data.dropna() # notnull() 인 객체들 반환

0        1
2    hello
dtype: object

In [41]:
df = pd.DataFrame([[1, np.nan, 2],
                  [2,3,5],
                  [np.nan,4,6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [42]:
df.dropna() # row 전체 삭제됨. data frame 에서는 단일 값 삭제 안됨

     0    1  2
1  2.0  3.0  5

In [44]:
df.dropna(axis='columns') # axis='columns' or axis=1 일 때 행으로 삭제

   2
0  2
1  5
2  6

In [46]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [53]:
print(df)
df.dropna(axis=1, how='all') # how = 'any', 하나라도 있으면 삭제, how = 'all' 다 있어야 삭제 
df.dropna(axis=1, thresh=2) # thresh는 최소 몇 개 이상 있어야 삭제할 지 선정

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [55]:
data = pd.Series([1,np.nan,2,None,3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [58]:
data.fillna(0) # fill = 0 으로 처리 
data.fillna(method='ffill') # ffill = forward fill, 앞 숫자로 fill, bfill은 back fill로 뒤에 오는거로!

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [61]:
print(df)

df.fillna(method='bfill', axis=1) # col 기준으로 옆 컬럼 걸 가져온다고 보면 됨

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

     0    1    2   3
0  1.0  2.0  2.0 NaN
1  2.0  3.0  5.0 NaN
2  4.0  4.0  6.0 NaN

## 계층적 인덱스 (hierarchical indexing)

In [63]:
import numpy as np
import pandas as pd

In [65]:
index = [('California', 2000), ('California', 2010),
         ('New York',2000), ('New York', 2010),
         ('Texas', 2000), ('Texas',2010)]
populations = [33871648, 37253956,
              18976457, 19378102,
              20851820, 25145561]

pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [66]:
pop[('California', 2010): ('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [68]:
pop[[i for i in pop.index if i[1] == 2010]] # 이런식으로 munging  그닥 비효율 대용량 처리시.

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64